Repository: OsmBelarus/Pieraklady
Catalog: isnujucyja_pieraklady/vioski.tmx
Source language: ru
Languages: be

source: Малые Ситцы
be: Малыя Сітцы

source: Малые Слижи
be: Малыя Сліжы

source: Малые Словени
be: Малыя Славені

source: Малые Смольянцы
be: Малыя Смальянцы

source: Малые Сонтаки
be: Малыя Сонтакі

source: Малые Стайки
be: Малыя Стайкі

source: Малые Стеблевичи
be: Малыя Сцяблевічы

source: Малые Степанишки
be: Малыя Сцяпанішкі

source: Малые Столпеняты
be: Малыя Стаўпяняты

source: Малые Стрелки
be: Малыя Стралкі

source: Малые Сухаревичи
be: Малыя Сухарэвічы

source: Малые Торонковичи
be: Малыя Таронкавічы

source: Малые Трубочи
be: Малыя Трубачы

source: Малые Туполы
be: Малыя Тупалы

source: Малые Угляны
be: Малыя Вугляны

source: Малые Укроповичи
be: Малыя Укропавічы

source: Малые Ульяновичи
be: Малыя Ульянавічы

source: Малые Хольневичи
be: Малыя Хальнявічы

source: Малые Хуторы
be: Малыя Хутары

source: Малые Чучевичи
be: Малыя Чучавічы

source: Малые Шестаки
be: Малыя Шастакі

source: Малые Шумилишки
be: Малыя Шумілішкі

source: Малые Щитники
be: Малыя Шчытнікі

source: Малые Эйсмонты
be: Малыя Эйсманты

source: Малые Якентаны
be: Малыя Якентаны

source: Малые Яковичи
be: Малыя Якавічы

source: Малые Яковчицы
be: Малыя Якаўчыцы

source: Малые Янушковичи
be: Малыя Янушкавічы

source: Малые Яцыны
be: Малыя Яцыны

source: Малыжено
be: Малыжана

source: Малый Боков
be: Малы Бокаў

source: Малый Бор
be: Малы Бор

source: Малый Быков
be: Малы Быкоў

source: Малый Вязок
be: Малы Вязок

source: Малый Галик
be: Малы Галік

source: Малый Грязивец
be: Малы Гразівец

source: Малый Двор
be: Малы Двор

source: Малый Жабин
be: Малы Жабін

source: Малый Каменец
be: Малы Каменец

source: Малый Красник
be: Малы Краснік

source: Малый Крушниковский
be: Малы Крушнікоўскі

source: Малый Кудин
be: Малы Кудзін

source: Малый Межник
be: Малы Мяжнік

source: Малый Михайлов
be: Малы Міхайлоў

source: Малый Озерецк
be: Малы Азярэцк

source: Малый Осовец
be: Малы Асавец

source: Малый Павлополь
be: Малы Паўлопаль

source: Малый Полсвиж
be: Малы Поўсвіж

source: Малый Рожан
be: Малы Рожан

source: Малый Старый Шклов
be: Малы Стары Шклоў

source: Малый Трилесин
be: Малы Трылесін

source: Малый Холожин
be: Малы Халажын

source: Малынишки
be: Малынішкі

source: Малышевичи
be: Малышэвічы

source: Малышево
be: Малышова

source: Малыши
be: Малышы

source: Малышки
be: Малышкі

source: Мальево
be: Мальева

source: Мальжонково
be: Мальжонкава

source: Малькевичи
be: Малькевічы

source: Мальки
be: Малькі

source: Мальковичи
be: Малькавічы

source: Мальковка
be: Малькаўка

source: Мальково
be: Малькава

source: Мальковщина
be: Малькаўшчына

source: Малюки
be: Малюкі

source: Малюковцы
be: Малюкоўцы

source: Малютино
be: Малюціна

source: Малюшино
be: Малюшына

source: Малюшичи
be: Малюшычы

source: Малявичи
be: Малявічы

source: Малявки
be: Маляўкі

source: Малявщина
be: Маляўшчына

source: Маляково
be: Малякова

source: Малятичи
be: Маляцічы

source: Мамаи
be: Мамаі

source: Мамойки
be: Мамойкі

source: Мамоли
be: Мамолі

source: Мамоново
be: Мамонава

source: Мамчиково
be: Мамчыкава

source: Мамыков
be: Мамыкаў

source: Мандрики
be: Мандрыкі

source: Маневичи
be: Манявічы

source: Маневщина
be: Манеўшчына

source: Манеев
be: Манееў

source: Манихи
be: Маніхі

source: Мантюты
be: Манцюты

source: Манулки
be: Манулкі

source: Манцевичи
be: Манцавічы

source: Манчаки
be: Манчакі

source: Манчели
be: Манчэлі

source: Манченяты
be: Манчаняты

source: Манчики
be: Манчыкі

source: Манчицы
be: Манчыцы

source: Маньковичи
be: Манькавічы

source: Маньково
be: Манькава

source: Маньковщина
be: Манькаўшчына

source: Манюки
be: Манюкі

source: Маранишки
be: Маранішкі

source: Марачи
be: Марачы

source: Марги
be: Маргі

source: Марговица
be: Маргавіца

source: Маревиль
be: Маравіль

source: Мариамполь
be: Марыямпаль

source: Мариница
be: Марыніца

source: Маринкино
be: Марынкіна

source: Мариново
be: Марынова

source: Маринополье
be: Марынаполле

source: Маринцы
be: Марынцы

source: Мариполь
be: Марыпаль

source: Марисево
be: Марысева

source: Маритон
be: Марытон

source: Марки
be: Маркі

source: Маркиняты
be: Маркіняты

source: Маркиши
be: Маркішы

source: Марковичи
be: [Маркавічы, Марковічы]

source: Марковка
be: Маркаўка

source: Марково
be: [Маркава, Маркова]

source: Марковское
be: Маркоўскае

source: Марковцы
be: [Маркаўцы, Маркоўцы]

source: Марковчизна
be: Маркаўчызна

source: Марковщина
be: Маркаўшчына

source: Маркути
be: Маркуці

source: Мармовичи
be: Мармавічы

source: Мартинелевичи
be: Марцінелевічы

source: Мартинишки
be: Марцінішкі

source: Мартинковичи
be: Марцінкавічы

source: Мартиновичи
be: Марцінавічы

source: Мартиновка
be: Марцінаўка

source: Мартиново
be: [Марцінава, Марцінова]

source: Мартиновцы
be: Марцінаўцы

source: Мартули
be: Мартулі

source: Мартыненки
be: Мартыненкі

source: Мартыновичи
be: Мартынавічы

source: Мартыновка
be: Мартынаўка

source: Мартынюки
be: Мартынюкі

source: Мартьяновичи
be: Марцьянавічы

source: Мартьяновцы
be: Марцянаўцы

source: Мартюхово
be: Марцюхова

source: Мартюши
be: Марцюшы

source: Марусино
be: Марусіна

source: Мархачёвщина
be: Мархачоўшчына

source: Мархлевск
be: Мархлеўск

source: Марцебалино
be: Марцабаліна

source: Марцебылино
be: Марцыбыліна

source: Марциново
be: Марцінова

source: Марцули
be: Марцулі

source: Марченки
be: Марчанкі

source: Марчёнки
be: Марчонкі

source: Маршалки
be: Маршалкі

source: Марьино
be: Мар’іна

source: Марьино Поле
be: Мар’іна Поле

source: Марьяливо
be: Мар’яліва

source: Марьяново
be: [Мар’янава, Мар’янова]

source: Марьянполье
be: Мар’янполле

source: Масалки
be: Масалкі

source: Масалыки
be: Масалыкі

source: Масальщина
be: Масальшчына

source: Масевичи
be: [Масевічы, Масявічы]

source: Масевцы
be: Масеўцы

source: Масенково
be: Масянкова

source: Маси
be: Масі

source: Масиловичи
be: Масілавічы

source: Масковичи
be: Маскавічы

source: Маслаки
be: Маслакі

source: Масленики
be: Масленікі

source: Масликовцы
be: Маслікаўцы

source: Маслино
be: Масліно

source: Маслицы
be: Масліцы

source: Масловичи
be: [Маславічы, Масловічы]

source: Масловщина
be: Маслаўшчына

source: Масницкое
be: Масніцкае

source: Массоляны
be: Масаляны

source: Мастище
be: Масцішча

source: Маськовцы
be: Маськаўцы

source: Масюки
be: Масюкі

source: Матвеевичи
be: Мацвеевічы

source: Матвеевцы
be: Мацвееўцы

source: Матевичи
be: Мацевічы

source: Матеевичи
be: Мацеевічы

source: Матеёвка
be: Мацяёўка

source: Матеево
be: Мацеева

source: Матеевцы
be: Мацееўцы

source: Матеевщина
be: Мацееўшчына

source: Матейки
be: Мацейкі

source: Матейково
be: Мацейкава

source: Матейковщина
be: Мацейкаўшчына

source: Матецкие
be: Матэцкія

source: Матеши
be: Мацешы

source: Матешицы
be: Мацешыцы

source: Матиёво
be: Маціёва

source: Матовщина
be: Матаўшчына

source: Матошки
be: Матошкі

source: Матрунки
be: Матрункі

source: Матуки
be: Матукі

source: Матусовка
be: Матусоўка

source: Матусово
be: Матусава

source: Матушево
be: Матушова

source: Матуши
be: Матушы

source: Матчицы
be: Матчыцы

source: Матыки
be: Матыкі

source: Матыковщина
be: Матыкаўшчына

source: Матырино
be: Матырына

source: Матьковские Пасеки
be: Мацькаўскія Пасекі

source: Матьковцы
be: Мацькаўцы

source: Матюки
be: Мацюкі

source: Матюково
be: Мацюкова

source: Матюлишки
be: Мацюлішкі

source: Матюляны
be: Мацюляны

source: Матюнцы
be: Мацюнцы

source: Матюты
be: Мацюты

source: Матюшенки
be: Мацюшонкі

source: Матюши
be: Мацюшы

source: Матюшино
be: Мацюшына

source: Матясы
be: Мацясы

source: Махалово
be: Махалава

source: Махирово
be: Махірова

source: Махновичи
be: Махнавічы

source: Маховка
be: Махоўка

source: Махово
be: Махава

source: Мацевичи
be: Мацавічы

source: Мацево
be: Мацава

source: Мацелишки
be: Мацэлішкі

source: Мацкевичи
be: Мацкевічы

source: Мацки
be: Мацкі

source: Мацковичи
be: Мацковічы

source: Мацково
be: Мацкова

source: Мацново
be: Мацнава

source: Мацуковщина
be: Мацукоўшчына

source: Мацылёвщина
be: Мацылёўшчына

source: Маческ
be: Мачаск

source: Мачужичи
be: Мачужычы

source: Мачулище
be: Мачулішча

source: Мачулищи
be: Мачулішчы

source: Мачульские
be: Мачульскія

source: Машелево
be: Машэлева

source: Машки
be: Машкі

source: Машкино
be: Машкіна

source: Маштарки
be: Маштаркі

source: Машуки
be: Машукі

source: Мащицы
be: Машчыцы

source: Маячное
be: Маячнае

source: Медведевка
be: Мядзведзеўка

source: Медведево
be: Мядзведзева

source: Медведёво
be: Медзвядзёва

source: Медведи
be: Мядзведзі

source: Медведино
be: Мядзведзіна

source: Медведица
be: Мядзведзіца

source: Медведичи
be: Мядзведзічы

source: Медвёдка
be: Мядзвёдка

source: Медвёдки
be: Мядзвёдкі

source: Медведники
be: Мядзведнікі

source: Медведное
be: Мядзведнае

source: Медведня
be: Мядзведня

source: Медведов
be: Медзведаў

source: Медведовка
be: Мядзведаўка

source: Медвёдовка
be: Мядзвёдаўка

source: Медведск
be: Мядзведск

source: Медведские
be: Мядзведскія

source: Медвежий Лог
be: Мядзведжы Лог

source: Медвежье
be: Мядзвежжа

source: Медвиновичи
be: Мядзвінавічы

source: Меденевичи
be: Мядзеневічы

source: Меденка
be: Медзенка

source: Меденое
be: Медзенае

source: Медики
be: Медзікі

source: Медков
be: Мядкоў

source: Медники
be: Меднікі

source: Медно
be: Медна

source: Медрики
be: Медрыкі

source: Мёдухов
be: Мёдухаў

source: Медухово
be: Медухава

source: Медынки Домашские
be: Мядынкі Дамашскія

source: Медынки Ёдловичские
be: Мядынкі Ёдлавіцкія

source: Медюки
be: Медзюкі

source: Медюны
be: Мядзюны

source: Межа
be: Мяжа

source: Межанка
be: Мяжанка

source: Межанцы
be: Мяжанцы

source: Межаны
be: Мяжаны

source: Междулесье
be: Міжлессе

source: Междуречье
be: [Мiжрэчча, Міжрэчча]

source: Межево
be: Межава

source: Межейки
be: Мяжэйкі

source: Меженин
be: Мяжэнін

source: Межёнка
be: Мяжонка

source: Межи
be: Межы

source: Межиёво
be: Межыёва

source: Межилесье
be: Межылессе

source: Межисетки
be: Мяжысеткі

source: Межица
be: Межыца

source: Межлесье
be: Міжлессе

source: Межная Слобода
be: Межная Слабада

source: Межники
be: Межнікі

source: Межница
be: Мяжніца

source: Межно
be: Межна

source: Межно 1
be: Мяжно 1

source: Межно 2
be: Мяжно 2

source: Межно 3
be: Мяжно 3

source: Межное
be: Мяжное

source: Межонка
be: Мяжонка

source: Межуи
be: Межуі

source: Мезеново
be: Мезенава

source: Мезинец
be: Мезінец

source: Мезовичи
be: Мязовічы

source: Мейлуны
be: Мяйлуны

source: Мейшты
be: Мяйшты

source: Мекяны
be: Мякяны

source: Мелевцы
be: Мелеўцы

source: Мелевщина
be: Мелеўшчына

source: Мелёгово
be: Мялёгава

source: Меленково
be: Мелянкова

source: Мелесница
be: Мелясніца

source: Мелехи
be: Меляхі

source: Мелеховичи
be: Мелехавічы

source: Мелеши
be: Меляшы

source: Мелешки
be: Мялешкі

source: Мелешковичи
be: Мялешкавічы

source: Мелитоново
be: Мелітонава

source: Мелихово
be: Мелехава

source: Мелковичи
be: Мелкавічы

source: Меловцы
be: Мелаўцы

source: Мелькановичи
be: Мяльканавічы

source: Мельковичи
be: Мелькавічы

source: Мельник
be: Мяльнік

source: Мельники
be: Мельнікі

source: Мельница
be: Мельніца

source: Мельница Сорочья
be: Сароча

source: Мельново
be: Мяльнова

source: Мелюзино
be: Мялюзіна

source: Меляховичи
be: Мяляхавічы

source: Меляши
be: Меляшы

source: Мендриковщина
be: Мендрыкаўшчына

source: Меневеж
be: Менявеж

source: Меница
be: Мяніца

source: Меньки
be: Мянькі

source: Менютево
be: Мянюцева

source: Менютки
be: Мянюткі

source: Мервины
be: Мервіны

source: Мергинцы
be: Мяргенцы

source: Мерецкие
be: Мярэцкія

source: Мерецкий Двор
be: Мярэцкі Двор

source: Мерешино
be: Мерашыно

source: Мерзляки
be: Мерзлякі

source: Мерзляково
be: Мерзлякова

source: Мерковичи
be: Мярковічы

source: Меркуловичи
be: Меркулавічы

source: Мерница
be: Мярніца

source: Меруги
be: Мяругі

source: Мерчицы
be: Мерчыцы

source: Мерчь
be: Мерч

source: Месёнковщина
be: Мясёнкаўшчына

source: Местечко
be: [Мястэчка, Мясцечка]

source: Местино
be: Месціна

source: Местковичи
be: Месткавічы

source: Месятичи
be: Мясяцічы

source: Метище
be: Мецішча

source: Метково
be: Меткава

source: Метличино
be: Мятлічына

source: Метличицы
be: Мятлічыцы

source: Метявичи
be: Мяцявічы

source: Мефёдовичи
be: Мяфёдавічы

source: Мехач
be: Мяхач

source: Мехеды
be: Мяхеды

source: Мехи
be: Мяхі

source: Меховка
be: Мехаўка

source: Мехово
be: Мехава

source: Меховое
be: Мехавое

source: Меховск
be: Мяхоўск

source: Меховщина
be: Мехаўшчына

source: Мечаи
be: Мечаі

source: Мешетники
be: Мяшэтнікі

source: Мешичи
be: Мешычы

source: Мешкели
be: Мяшкелі

source: Мешки
be: Мяшкі

source: Мешково
be: Мяшкова

source: Мешкути
be: [Мешкуці, Мяшкуці]

source: Мешляны
be: Мяшляны

source: Мештовичи
be: Мештавічы

source: Мещенцы
be: Мяшчэнцы

source: Мигай
be: Мігай

source: Мигдаловичи
be: Мігдалавічы

source: Мигдалы
be: Мігдалы

source: Миговка
be: Мігаўка

source: Мигово
be: Мігова

source: Мигули
be: Мігулі

source: Мигуны
be: Мігуны

source: Мидровщина
be: Мідраўшчына

source: Мижаны
be: Міжаны

source: Мижевичи
be: Міжэвічы

source: Мижево
be: Міжава

source: Мижеричи
be: Міжэрычы

source: Мижидерево
be: Міжыдзерава

source: Мижилище
be: Міжылішча

source: Мижречье
be: Міжрэчча

source: Мизгири
be: Мізгіры

source: Мизуличи
be: Мізулічы

source: Микасецк
be: Мікасецк

source: Микелевщина
be: Мікелеўшчына

source: Микитск
be: Мікіцк

source: Миклаши
be: Міклашы

source: Миклашовцы
be: Міклашоўцы

source: Микли
be: Міклі

source: Миколаевичи
be: Нікалаевічы

source: Миколаевка
be: Мікалаеўка

source: Миколаево
be: Мікалаева

source: Миколаевщина
be: Мікалаеўшчына

source: Миколаюнцы
be: Мікалаюнцы

source: Миколенка
be: Міколенка

source: Миколка
be: Міколка

source: Микольск
be: Мікольск

source: Микольцы
be: Мікольцы

source: Микулевщина
be: Мікулеўшчына

source: Микулинка
be: Мікулінка

source: Микулино
be: Мікуліна

source: Микулинск
be: Мікулінск

source: Микуличи
be: Мікулічы

source: Микулишки
be: Мікулішкі

source: Микуль-Городок
be: Мікуль-Гарадок

source: Микуты
be: Мікуты

source: Микутяны
be: Мікуцяны

source: Микшаны
be: Мікшаны

source: Микшевичи
be: Мікшавічы

source: Микянцы
be: Мікянцы

source: Милайшуны
be: Мілайшуны

source: Милаши
be: Мілашы

source: Милашки
be: Мілашкі

source: Милашово
be: Мілашова

source: Милевичи
be: [Мілевічы, Мілявічы]

source: Милевцы
be: Мілеўцы

source: Милейки
be: Мілейкі

source: Милейково
be: [Мілейкава, Мілэйкава]

source: Милидовщина
be: Мілідаўшчына

source: Милованье
be: Мілаванне

source: Миловидная
be: Мілавідная

source: Миловиды
be: Мілавіды

source: Миловьё
be: Мілаўё

source: Милоград
be: Мілаград

source: Милое
be: Мілое

source: Миложень
be: Мілажань

source: Милославичи
be: Мілаславічы

source: Милостово
be: Міластава

source: Милошевичи
be: [Мілашавічы, Мілошавічы]

source: Милты
be: Мілты

source: Милути
be: Мілуці

source: Милушево
be: Мілушава

source: Мильва-Березина
be: Мільва-Бярэзіна

source: Мильки
be: Мількі

source: Мильковичи
be: Мількавічы

source: Мильковцы
be: Мількаўцы

source: Мильковщина
be: Мількаўшчына

source: Милькунь
be: Мількунь

source: Мильцеи
be: Мільцеі

source: Мильча
be: Мільча

source: Милюнцы
be: Мілюнцы

source: Милюны
be: Мілюны

source: Милятино
be: Міляціна

source: Минаки
be: Мінакі

source: Миндяны
be: Міндзяны

source: Миневичи
be: [Міневічы, Мінявічы]

source: Миневщина
be: Мінеўшчына

source: Минейты
be: Мінэйты

source: Минины
be: Мініны

source: Миничи
be: Мінічы

source: Минки
be: Мінкі

source: Минковичи
be: Мінкавічы

source: Минойты
be: Мінойты

source: Минотовичи
be: Мінотавічы

source: Минти
be: Мінці

source: Минтурово
be: Мінтурова

source: Минчаки
be: Мінчакі

source: Минчики
be: Мінчыкі

source: Миньков
be: Мінькаў

source: Минютевка
be: Мінюцеўка

source: Минянка
be: Мінянка

source: Миорки 2
be: Мёркі 2

source: Мир
be: Мір

source: Мирадино
be: Мірадзіна

source: Миранка
be: Міранка

source: Миратино
be: Міраціна

source: Миратичи
be: Мірацічы

source: Мирклишки
be: Мірклішкі

source: Мирная
be: Мірная

source: Мирное
be: Мірнае

source: Мирный
be: Мірны

source: Мировщина
be: Міроўшчына

source: Мирогощь
be: Мірагошч

source: Мироненки
be: Міроненкі

source: Мироним
be: Міронім

source: Мироново
be: Міронава

source: Мирончики
be: Мірончыкі

source: Мироны
be: Міроны

source: Мирославка
be: Міраслаўка

source: Мисевичи
be: Місявічы

source: Мислюки
be: Міслюкі

source: Мисовцы
be: Місаўцы

source: Миссури
be: Місуры

source: Мистровка
be: Містраўкі

source: Мисуны
be: Місуны

source: Миськие
be: Міськія

source: Мисюковщина
be: Місюкоўшчына

source: Мисянцы
be: Місянцы

source: Митавьё
be: Мітаўё

source: Митиненты
be: Міціненты

source: Миткевичи
be: Міткевічы

source: Митрони
be: Мітрані

source: Митропольщина
be: Мітрапольшчына

source: Митьки
be: Міцькі

source: Митьковичи
be: Міцькавічы

source: Митьковцы
be: Міцькаўцы

source: Митьковщина
be: Міцькаўшчына

source: Митюково
be: Міцюкова

source: Митюны
be: Міцюны

source: Михайлов
be: Міхайлоў

source: Михайловичи
be: Міхайлавічы

source: Михайловка
be: Міхайлаўка

source: Михайлово
be: [Міхайлава, Міхайлова]

source: Михайловск
be: Міхайлаўск

source: Михайловский
be: Міхайлаўскі

source: Михайловское
be: Міхайлаўскае

source: Михайловщина
be: [Міхайлаўшчына, Міхайлоўшчына]

source: Михайлы
be: Міхайлы

source: Михалёвка
be: Міхалёўка

source: Михалёво
be: Міхалёва

source: Михалёво 1
be: Міхалёва 1

source: Михалёво 2
be: Міхалёва 2

source: Михалёво 3
be: Міхалёва 3

source: Михалёвцы
be: Міхалёўцы

source: Михалевщина
be: Міхалеўшчына

source: Михали
be: Міхалі

source: Михалин
be: Міхалін

source: Михалинка
be: Міхалінка

source: Михалино
be: [Міхаліна, Міхаліно]

source: Михалиново
be: Міхалінава

source: Михалинок
be: Міхалінак

source: Михалишки
be: Міхалішкі

source: Михалки
be: Міхалкі

source: Михалковичи
be: Міхалкавічы

source: Михалково
be: Міхалкова

source: Михалкони
be: Міхалконі

source: Михалов
be: Міхалоў

source: Михаловка
be: Міхалоўка

source: Михалово
be: Міхалова

source: Михалполье
be: Міхалполле

source: Михальки
be: Міхалькі

source: Михальцы
be: Міхальцы

source: Михановичи
be: Міханавічы

source: Михасёвка
be: Міхасёўка

source: Михедовичи
be: Міхедавічы

source: Михеевичи
be: Міхеевічы

source: Михеевка
be: Міхееўка

source: Михеевцы
be: Міхееўцы

source: Михейки
be: Міхейкі

source: Михейково
be: Міхейкава

source: Михлин
be: Міхлін

source: Михневичи
be: Міхневічы

source: Михничи
be: Міхнічы

source: Михновичи
be: Міхнавічы

source: Михновка
be: Міхнаўка

source: Михново
be: Міхнава

source: Михновцы
be: Міхнаўцы

source: Михновщина
be: Міхнаўшчына

source: Мицары
be: Міцары

source: Мицканцы
be: Міцканцы

source: Мицкевичи
be: Міцкевічы

source: Мицкяны
be: Міцкяны

source: Мицуры
be: Міцуры

source: Мичуринская
be: Мічурынская

source: Мишаны
be: Мішаны

source: Мишевичи
be: Мішавічы

source: Мишкалы
be: Мішкалы

source: Мишкеники
be: Мішкенікі

source: Мишковичи
be: Мішкавічы

source: Мишковка
be: Мішкаўка

source: Мишневичи
be: Мішневічы

source: Мишни
be: Мішні

source: Мишуковичи
be: Мішуковічы

source: Мишуково
be: Мішчукова

source: Мишульки
be: Мішулькі

source: Мишутино
be: Мішуціна

source: Мишутки
be: Мішуткі

source: Мишуты
be: Мішуты

source: Млёхово
be: Млёхава

source: Млечки
be: Млечкі

source: Мнихи
be: Мніхі

source: Мнюто 1
be: Мнюта 1

source: Мнюто 2
be: Мнюта 2

source: Мнюхи
be: Мнюхі

source: Могилёвка
be: Магілёўка

source: Могилёвцы
be: Магілёўцы

source: Могилицы
be: Магіліцы

source: Могильно
be: Магільна

source: Могильное
be: Магільнае

source: Могиляны
be: Магіляны

source: Могуны
be: Магуны

source: Можеевка
be: Мажэеўка

source: Можейки
be: Мажэйкі

source: Можейково
be: Мажэйкава

source: Можулево
be: Мажулева

source: Мозолевщина
be: Мазалеўшчына

source: Мозоли
be: Мазалі

source: Моисеевичи
be: [Майсеевічы, Маісеевічы]

source: Моисеевка
be: Маісееўка

source: Моисеево
be: Маісеева

source: Моисеевщина
be: Маісееўшчына

source: Моисеенки
be: Маісеенкі

source: Мойсеевичи
be: Майсеевічы

source: Мойсеевка
be: Майсееўка

source: Мойсичи
be: Мойсічы

source: Мокиш
be: Мокіш

source: Моклище
be: Моклішча

source: Моковичи
be: Мокавічы

source: Мокрадь
be: Мокрадзь

source: Мокраки
be: Макракі

source: Мокраны
be: Макраны

source: Мокредь
be: Мокрадзь

source: Мокрец
be: Макрэц

source: Мокрица
be: Мокрыца

source: Мокрицы
be: Макрыцы

source: Мокричевщина
be: Макрычаўшчына

source: Мокровичи
be: Мокравічы

source: Мокрово
be: Мокрава

source: Мокрое
be: Мокрае

source: Мокрусинка
be: Макрусінка

source: Мокрядка
be: Макрадка

source: Мокрянские Хутора
be: Макранскія Хутары

source: Мокряны
be: Макраны

source: Молдовичи
be: Малдавічы

source: Молдути
be: Малдуці

source: Молодеево
be: Маладзеева

source: Молодёжки
be: Маладзёжкі

source: Молодельчицы
be: Маладзельчыцы

source: Молоди
be: Моладзі

source: Молоднево
be: Маладнева

source: Молодово
be: Моладава

source: Молодь
be: Моладзь

source: Моложане
be: Малажане

source: Молот
be: Молат

source: Молотино
be: Малоціна

source: Молотковичи
be: Малоткавічы

source: Молотково
be: Малоткава

source: Молотовка
be: Малатоўка

source: Молотовки
be: Малатоўкі

source: Молотынь
be: Малотынь

source: Молочки
be: [Малачкі, Малочкі]

source: Молуновка
be: Малуноўка

source: Молчадь
be: Моўчадзь

source: Молчанки
be: Маўчанкі

source: Молчаны
be: Маўчаны

source: Мольги
be: Мальгі

source: Мольдевичи
be: Мольдзевічы

source: Мольничи
be: Мольнічы

source: Молявка
be: Маляўка

source: Молярка
be: Малярка

source: Моназыль
be: Маназыль

source: Монастырёк
be: Манастырок

source: Монастырь
be: Манастыр

source: Монголия
be: Манголія

source: Моневка
be: Монеўка

source: Моносеево
be: Манасеева

source: Монтатишки
be: Монтацішкі

source: Монтовты
be: Монтаўты

source: Монтяки
be: Манцякі

source: Мончаки
be: Манчакі

source: Моньки
be: Монькі

source: Моньковичи
be: Монькавічы

source: Моньково
be: Монькава

source: Моньковцы
be: Монькаўцы

source: Моняково
be: Манякова

source: Моралёвка
be: Маралёўка

source: Морги
be: Маргі

source: Морговичи
be: Моргавічы

source: Моргойцы
be: Маргойцы

source: Мордасы
be: Мардасы

source: Мордахи
be: Мардахі

source: Мордвин
be: Мардзвін

source: Морино
be: Морына

source: Морможево
be: Мормажава

source: Моровщина
be: Мораўшчына

source: Морозова Слободка
be: Марозава Слабодка

source: Морозовичи
be: Марозавічы

source: Морозовка
be: Марозаўка

source: Морозово
be: Марозава

source: Морозовщина
be: Марозаўшчына

source: Морозы
be: [Маразы, Марозы]

source: Мороськи
be: Мароські

source: Морохорово
be: Марохарава

source: Морочи
be: Марачы

source: Морочи 2-е
be: Марочы 2

source: Морочково
be: Марачкова

source: Морочь
be: Морач

source: Морховичи
be: Морхавічы

source: Морщиновичи
be: Моршчынавічы

source: Мосевичи
be: Масявічы

source: Мосевцы
be: Мосеўцы

source: Мосеевка
be: Масееўка

source: Мосейки
be: Масяйкі

source: Мосин
be: Мосін

source: Москалёвка
be: Маскалёўка

source: Москалёвцы
be: Маскалёўцы

source: Москалевщина
be: Маскалеўшчына

source: Москалёнки
be: Маскалёнкі

source: Москаленята
be: Маскаляняты

source: Москали
be: Маскалі

source: Москалишки
be: Маскалішкі

source: Московская Гора
be: Маскоўская Гара

source: Мосорево
be: Мосарава

source: Моссоры
be: Масоры

source: Моствилишки
be: Маствілішкі

source: Мостиловичи
be: Масцілавічы

source: Мостицкая Слобода
be: Масціцкая Слабада

source: Мостище
be: Масцішча

source: Мостище 1
be: Масцішча 1

source: Мостище 2
be: Масцішча 2

source: Мостки
be: [Масткі, Мосткі]

source: Мостково
be: Масткова

source: Мостовая
be: Маставая

source: Мостовики
be: Маставікі

source: Мостовляны
be: Мастаўляны

source: Мостовой
be: Маставы

source: Мостовуха
be: Маставуха

source: Мосток
be: Масток

source: Мосты
be: Масты

source: Мостыки
be: Мастыкі

source: Мосты Левые
be: Масты Левыя

source: Мосты Правые
be: Масты Правыя

source: Мостытычи
be: Мастытычы

source: Мостяны
be: Масцяны

source: Мотевичи
be: Моцевічы

source: Мотевки
be: Моцеўкі

source: Мотевцы
be: Моцеўцы

source: Мотевчуки
be: Мацеўчукі

source: Мотневичи
be: Матнявічы
